Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваров/Ext/ManagerModule.bsl
// Печать накладной с сортировкой строк
Процедура ПечатьНакладной(ТабДок, Ссылка, ВариантСортировки) Экспорт
	
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("ПечатьНакладной");
	
	// Берем первый документ, если пришел массив
	Если ТипЗнч(Ссылка) = Тип("Массив") Тогда
		СсылкаНаДокумент = Ссылка[0];
	Иначе
		СсылкаНаДокумент = Ссылка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| РеализацияТоваров.Номер КАК Номер,
	| РеализацияТоваров.Дата КАК Дата,
	| РеализацияТоваров.Клиент КАК Клиент,
	| РеализацияТоваров.СуммаИтого КАК СуммаИтого,
	| РеализацияТоваровТовары.НомерСтроки КАК НомерСтроки,
	| РеализацияТоваровТовары.Товар.Наименование КАК Товар,
	| РеализацияТоваровТовары.Цена КАК Цена,
	| РеализацияТоваровТовары.Количество КАК Количество,
	| РеализацияТоваровТовары.Сумма КАК Сумма
	|ИЗ
	| Документ.РеализацияТоваров КАК РеализацияТоваров
	| ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваров.Товары КАК РеализацияТоваровТовары
	| ПО РеализацияТоваров.Ссылка = РеализацияТоваровТовары.Ссылка
	|ГДЕ
	| РеализацияТоваров.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	Результат = Запрос.Выполнить();
	
	ТаблицаТоваров = Результат.Выгрузить();
	ТаблицаТоваров.Колонки.Добавить("КлючСортировки");
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		Если ВариантСортировки = "ПоДлинеНаименования" Тогда
			Строка.КлючСортировки = СтрДлина(Строка.Товар);
		ИначеЕсли ВариантСортировки = "ПоНаименованию" Тогда
			Строка.КлючСортировки = Строка.Товар;
		ИначеЕсли ВариантСортировки = "ПоЦене" Тогда
			Строка.КлючСортировки = Строка.Цена;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаТоваров.Сортировать("КлючСортировки Возр");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ПерваяСтрока = ТаблицаТоваров[0];
	ОбластьЗаголовок.Параметры.Номер = Число(ПерваяСтрока.Номер);
	ОбластьЗаголовок.Параметры.Дата = Формат(ПерваяСтрока.Дата, "ДЛФ=D");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Клиент = ПерваяСтрока.Клиент;
	ТабДок.Вывести(Шапка);
	
	ТабДок.Вывести(ОбластьТоварыШапка);
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		ОбластьТовары.Параметры.Заполнить(СтрокаТовара);
		ТабДок.Вывести(ОбластьТовары);
	КонецЦикла;
	
	Подвал.Параметры.СуммаИтого = ПерваяСтрока.СуммаИтого;
	ТабДок.Вывести(Подвал);
	
КонецПроцедуры
